package com.example.proburok.New_Class;

public enum SafetyInstruction {
    TEMPLATE_1("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком кровли и боков выработки для выявления заколов; при необходимости обобрать заколы ломиком или механизированным способом; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. Длина шпуров должна быть равна длине активной части анкера (допускается увеличение длины до 5 см);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки к забою, от кровли к бокам):\n" +
            "а) подготовить ампулы к применению (температура содержимого ампул должна быть в пределах температуры массива);\n" +
            "б) последовательно ввести в шпур все ампулы с помощью пневмодосыльника;\n" +
            "в) установить штангу в комплекте с армокаркасом и опорной плитой в шпиндель перфоратора и подать ее с обязательным вращением со скоростью 450 ÷ 500 об./мин до забоя шпура в течение около пяти секунд. Вращение производить по всей длине ампул – подача анкера без перемешивания ампул запрещена;\n" +
            "г) выполнить перемешивание состава в течение не менее 10 с, но не более времени желатинизации ампулы, указанного на упаковке;\n" +
            "д) остановить вращение перфоратора, удержание штанги до полного отверждения состава в течение установленного производителем времени. При температуре ампулы и окружающего воздуха ниже плюс 20 °С время перемешивания и удержания анкера в шпуре увеличивается; при температуре ампулы и окружающего воздуха выше плюс 20 °С – уменьшается. Время перемешивания состава ампулы и время удержания определяется опытным путем. При транспортировке или хранении ампул при температуре ниже плюс 10 °С, ампулы перед применением необходимо выдержать в шахтных условиях в течение не менее 12 часов;\n" +
            "е) выполнить установку опорной плиты с предварительным закручиванием гайки до отказа и до прижатия плиты к массиву.\n" +
            "7) Перед началом работ по торкретированию выполнить подготовку оборудования к работе в соответствии с инструкцией по эксплуатации. Доставить необходимое количество смеси для крепления участка выработки к месту производства работ;\n" +
            "8) Торкретирование выполнять:\n" +
            "- в массиве «1», «2» и «4» классов как изолирующее покрытие проектной толщиной слоя t по всему контуры выработки;\n" +
            "- в массиве «3» и «5» классов как несущий элемент крепи с проектной толщиной слоя t с соблюдением покрытия затяжки. Торкретирование выполняется методом сглаживания неровностей обнажения: наибольшая толщина слоя на углублениях, меньшая – на выступах; производится покрытие армокаркаса таким образом, чтобы слой бетона полностью покрывал арматуру (визуально могут быть заметны контур и очертания армокаркаса). \n"),
    TEMPLATE_2("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком кровли и боков выработки для выявления заколов; при необходимости обобрать заколы ломиком или механизированным способом; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. При применении ФА, длина шпуров должна быть больше на 10 см активной длины анкера (рекомендуется более 20 см с учетом возможного обыгрывания и последующей доустановкой). При применении СПА длина шпуров должна быть равна длине активной части анкера (допускается увеличение длины до 5 см);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки к забою, от кровли к бокам).\n" +
            "При применении сталеполимерной анкерной крепи (СПА):\n" +
            "а) подготовить ампулы к применению (температура содержимого ампул должна быть в пределах температуры массива);\n" +
            "б) последовательно ввести в шпур все ампулы с помощью пневмодосыльника;\n" +
            "в) установить штангу в комплекте с армокаркасом и опорной плитой в шпиндель перфоратора и подать ее с обязательным вращением со скоростью 450 ÷ 500 об./мин до забоя шпура в течение около пяти секунд. Вращение производить по всей длине ампул – подача анкера без перемешивания ампул запрещена;\n" +
            "г) выполнить перемешивание состава в течение не менее 10 с, но не более времени желатинизации ампулы, указанного на упаковке;\n" +
            "д) остановить вращение перфоратора, удержание штанги до полного отверждения состава в течение установленного производителем времени. При температуре ампулы и окружающего воздуха ниже плюс 20 °С время перемешивания и удержания анкера в шпуре увеличивается; при температуре ампулы и окружающего воздуха выше плюс 20 °С – уменьшается. Время перемешивания состава ампулы и время удержания определяется опытным путем. При транспортировке или хранении ампул при температуре ниже плюс 10 °С, ампулы перед применением необходимо выдержать в шахтных условиях в течение не менее 12 часов;\n" +
            "е) выполнить установку опорной плиты с предварительным закручиванием гайки до отказа и до прижатия плиты к массиву.\n" +
            "При применении фрикционной анкерной крепи (ФА):\n" +
            "а) после разбуривания ряда шпуров, производится установка специального вкладыша на люнет и замена буровой штанги с коронкой на забойник с пуансоном;\n" +
            "б) произвести установку комплекта анкерной крепи (штанга, шайба, армокаркас) на стрелу буровой установки (пуансон); \n" +
            "в) подачей перфоратора с ударной нагрузкой выполнить забивку анкера в шпур до полного прилегания шайбы и армокаркаса к массиву. При необходимости выполнить поджатие армокаркаса стрелой буровой установки."),
    TEMPLATE_3("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком кровли и боков выработки для выявления заколов; при необходимости обобрать заколы ломиком или механизированным способом; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. При применении ФА, длина шпуров должна быть больше на 10 см активной длины анкера (рекомендуется более 20 см с учетом возможного обыгрывания и последующей доустановкой). При применении СПА длина шпуров должна быть равна длине активной части анкера (допускается увеличение длины до 5 см);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки к забою, от кровли к бокам).\n" +
            "При применении сталеполимерной анкерной крепи (СПА):\n" +
            "а) подготовить ампулы к применению (температура содержимого ампул должна быть в пределах температуры массива);\n" +
            "б) последовательно ввести в шпур все ампулы с помощью пневмодосыльника;\n" +
            "в) установить штангу в комплекте с армокаркасом и опорной плитой в шпиндель перфоратора и подать ее с обязательным вращением со скоростью 450 ÷ 500 об./мин до забоя шпура в течение около пяти секунд. Вращение производить по всей длине ампул – подача анкера без перемешивания ампул запрещена;\n" +
            "г) выполнить перемешивание состава в течение не менее 10 с, но не более времени желатинизации ампулы, указанного на упаковке;\n" +
            "д) остановить вращение перфоратора, удержание штанги до полного отверждения состава в течение установленного производителем времени. При температуре ампулы и окружающего воздуха ниже плюс 20 °С время перемешивания и удержания анкера в шпуре увеличивается; при температуре ампулы и окружающего воздуха выше плюс 20 °С – уменьшается. Время перемешивания состава ампулы и время удержания определяется опытным путем. При транспортировке или хранении ампул при температуре ниже плюс 10 °С, ампулы перед применением необходимо выдержать в шахтных условиях в течение не менее 12 часов;\n" +
            "е) выполнить установку опорной плиты с предварительным закручиванием гайки до отказа и до прижатия плиты к массиву.\n" +
            "При применении фрикционной анкерной крепи (ФА):\n" +
            "а) после разбуривания ряда шпуров, производится установка специального вкладыша на люнет и замена буровой штанги с коронкой на забойник с пуансоном;\n" +
            "б) произвести установку комплекта анкерной крепи (штанга, шайба, армокаркас) на стрелу буровой установки (пуансон); \n" +
            "в) подачей перфоратора с ударной нагрузкой выполнить забивку анкера в шпур до полного прилегания шайбы и армокаркаса к массиву. При необходимости выполнить поджатие армокаркаса стрелой буровой установки.\n" +
            "7) Перед началом работ по торкретированию выполнить подготовку оборудования к работе в соответствии с инструкцией по эксплуатации. Доставить необходимое количество смеси для крепления участка выработки к месту производства работ;\n" +
            "8) Торкретирование выполнять:\n" +
            "- в массиве «1», «2» и «4» классов как изолирующее покрытие проектной толщиной слоя t по всему контуры выработки;\n" +
            "- в массиве «3» и «5» классов как несущий элемент крепи с проектной толщиной слоя t с соблюдением покрытия затяжки. Торкретирование выполняется методом сглаживания неровностей обнажения: наибольшая толщина слоя на углублениях, меньшая – на выступах; производится покрытие армокаркаса таким образом, чтобы слой бетона полностью покрывал арматуру (визуально могут быть заметны контур и очертания армокаркаса). \n"),
    TEMPLATE_4("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком кровли и боков выработки для выявления заколов; при необходимости обобрать заколы ломиком или механизированным способом; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. Длина шпуров должна быть больше на 10 см активной длины анкера (рекомендуется более 20 см с учетом возможного обыгрывания и последующей доустановкой);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки к забою, от кровли к бокам):\n" +
            "г) после разбуривания ряда шпуров, производится установка специального вкладыша на люнет и замена буровой штанги с коронкой на забойник с пуансоном;\n" +
            "д) произвести установку комплекта анкерной крепи (штанга, шайба, армокаркас) на стрелу буровой установки (пуансон); \n" +
            "е) подачей перфоратора с ударной нагрузкой выполнить забивку анкера в шпур до полного прилегания шайбы и армокаркаса к массиву. При необходимости выполнить поджатие армокаркаса стрелой буровой установки. \n"),
    TEMPLATE_5("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком контура выработки для выявления заколов; при необходимости обобрать заколы; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. Длина шпуров должна быть равна длине активной части анкера (допускается увеличение длины до 5 см);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки):\n" +
            "а) подготовить ампулы к применению (температура содержимого ампул должна быть в пределах температуры массива);\n" +
            "б) последовательно ввести в шпур все ампулы с помощью досыльника, уплотнить;\n" +
            "в) установить штангу в комплекте с армокаркасом и опорной плитой в шпиндель перфоратора и подать ее с обязательным вращением со скоростью 450 ÷ 500 об./мин до забоя шпура в течение около пяти секунд. Вращение производить по всей длине ампул – подача анкера без перемешивания ампул запрещена;\n" +
            "г) выполнить перемешивание состава в течение не менее 10 с, но не более времени желатинизации ампулы, указанного на упаковке;\n" +
            "д) остановить вращение перфоратора, удержание штанги до полного отверждения состава в течение установленного производителем времени. При температуре ампулы и окружающего воздуха ниже плюс 20 °С время перемешивания и удержания анкера в шпуре увеличивается; при температуре ампулы и окружающего воздуха выше плюс 20 °С – уменьшается. Время перемешивания состава ампулы и время удержания определяется опытным путем. При транспортировке или хранении ампул при температуре ниже плюс 10 °С, ампулы перед применением необходимо выдержать в шахтных условиях в течение не менее 12 часов;\n" +
            "е) выполнить установку опорной плиты с предварительным закручиванием гайки до отказа и до прижатия плиты к массиву.\n" +
            "7) Перед началом работ по торкретированию выполнить подготовку оборудования к работе в соответствии с инструкцией по эксплуатации. Доставить необходимое количество смеси для крепления участка выработки к месту производства работ;\n" +
            "8) Торкретирование выполнять как изолирующее покрытие проектной толщиной слоя t по всему контуру выработки. Производится покрытие армокаркасов таким образом, чтобы слой бетона полностью покрывал арматуру (визуально могут быть заметны контур и очертания армокаркаса).\n" ),
    TEMPLATE_6("1) Перед производством работ произвести контроль состава рудничной атмосферы на отсутствие ядовитых газов и простукивание кровлеоборочным ломиком контура выработки для выявления заколов; при необходимости обобрать заколы; \n" +
            "2) Доставить на место производства работ все необходимые крепежные материалы, оборудование и инструменты, в т.ч. для выполнения оперативного ремонта в количестве, достаточном для полного крепления участка выработки;\n" +
            "3) Выполнить контроль соответствия диаметра буровой коронки паспортному значению. Выполнить разбуривание шпуров под анкерную крепь с обеспечением паспортного шага и углов относительно контура. Продуть шпуры сжатым воздухом или промыть водой для полного удаления буровой мелочи;\n" +
            "4) Выполнить контроль соответствия глубины шпуров и их диаметра паспортному значению. Длина шпуров должна быть равна длине активной части анкера (допускается увеличение длины до 5 см);\n" +
            "5) Выполнить осмотр комплектов анкерной крепи для установки на данном участке работ. Деформированные анкеры или армокаркасы, не позволяющие произвести их штатную установку, исключить к использованию; \n" +
            "6) Выполнить установку анкерного крепления (крепление производить строго в направлении от закрепленной части выработки):\n" +
            "а) подготовить ампулы к применению (температура содержимого ампул должна быть в пределах температуры массива);\n" +
            "б) последовательно ввести в шпур все ампулы с помощью досыльника, уплотнить;\n" +
            "в) установить штангу в комплекте с армокаркасом и опорной плитой в шпиндель перфоратора и подать ее с обязательным вращением со скоростью 450 ÷ 500 об./мин до забоя шпура в течение около пяти секунд. Вращение производить по всей длине ампул – подача анкера без перемешивания ампул запрещена;\n" +
            "г) выполнить перемешивание состава в течение не менее 10 с, но не более времени желатинизации ампулы, указанного на упаковке;\n" +
            "д) остановить вращение перфоратора, удержание штанги до полного отверждения состава в течение установленного производителем времени. При температуре ампулы и окружающего воздуха ниже плюс 20 °С время перемешивания и удержания анкера в шпуре увеличивается; при температуре ампулы и окружающего воздуха выше плюс 20 °С – уменьшается. Время перемешивания состава ампулы и время удержания определяется опытным путем. При транспортировке или хранении ампул при температуре ниже плюс 10 °С, ампулы перед применением необходимо выдержать в шахтных условиях в течение не менее 12 часов;\n" +
            "е) выполнить установку опорной плиты с предварительным закручиванием гайки до отказа и до прижатия плиты к массиву. \n");

    //TEMPLATE_1(""),
    private final String text;
    SafetyInstruction(String text) { this.text = text; }
    public String getText() { return text; }

    public static SafetyInstruction forNumber(int number) {
        return switch (number) {
            case 1,7 -> TEMPLATE_1;
            case 2 -> TEMPLATE_2;
            case 3,8 -> TEMPLATE_3;
            case 4 -> TEMPLATE_4;
            case 5 -> TEMPLATE_5;
            case 6 -> TEMPLATE_6;
            default -> throw new IllegalArgumentException();
        };
    }
    }

